#!/bin/bash
# ************************************************************************
# set-in-math

# The script creates a mathematical set of different elements
# [Скрипт создаёт математическое множество из разных элементов]

# Script implementation - Max Romanenko (Red Alert) - 2022.
# Реализация скрипта - Макс Романенко (Red Alert) - 2022г.
# ************************************************************************
# function set-in-math

# creating a mathematical set
# [создание математического множества]
set-in-math(){ # args: element_1 ... element_N
    # --------------------------------------------------------------------
    local arr=${@} # local arr=${*}
    # echo "arr = ${arr}" # test
    local set
    # set+=( 1 ); set+=( 2 ) # test
    # echo "set = ${set[@]}" # test
    # --------------------------------------------------------------------
}
# ************************************************************************
set-in-math "1" "2" "3" "1" "2" "3" "1" "2" "3"
# ************************************************************************